CityDistanceCA/test/TestCase4/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:cit="http://j2ee.netbeans.org/wsdl/CityDistance/src/CityDistance">
  <soapenv:Body>
    <cit:GetCityDistance>
      <City1>Paris</City1>
      <Country1>France</Country1>
      <City2>Bruxelles</City2>
      <Country2>Belgium</Country2>
      <LengthUnit>Angstroms</LengthUnit>
    </cit:GetCityDistance>
  </soapenv:Body>
</soapenv:Envelope>